#include <iostream>
using std::cin;
using std::cout;
using std::string;


int main()
{
    std::setlocale(LC_ALL, ".UTF-8");
    
    // Объявление статического массива
    // (без инициализации, что плохо).
    // Массив целых чисел на 10 элементов
    int numbers[10];  // 10 - это длина массива
    
    // Элементы нумерются, начиная с 0.
    // В данном примере от 0 до 9
    
    numbers[0] = 999;  // Здесь 0 - это уже индекс (номер) элемента
    numbers[5] = numbers[0] + 100000;
    
    // Распечатка элементов массива.
    for (int index = 0; index < 10; ++index)
    {
        // Возможно, какие-то элементы будут
        // имет "мусорные" значения
        cout << index << ": " << numbers[index] << "\n";
    }
    
    return 0;
}









